Repository: allsecure-pay/exchange-woocommerce
Catalog: allsecureexchange/languages/allsecureexchange-*.po
Languages: bs_ba, sr_rs

source: Title
sr_rs: Naziv

source: Description
bs_ba: Opis
sr_rs: Opis

source: Operation Mode
bs_ba: Operativno okruženje
sr_rs: Operativno okruženje

source: API Credentials
bs_ba: Parametri za povezivanje
sr_rs: Parametri za povezivanje

source: Payment Details
bs_ba: Podaci o platnim transakcijama
sr_rs: Podaci o platnim transakcijama

source: Transaction Type
bs_ba: Vrsta Transakcije
sr_rs: Vrsta Transakcije

source: Debit
bs_ba: Naplata
sr_rs: Naplata

source: Preauthorize
bs_ba: Preautorizacija
sr_rs: Preautorizacija

source: Enable transaction details in the confirmation email
sr_rs: Omogućite detalje transakcije u email-u potvrde

source: When enabled, plugin will add transaction details in the order confirmation email.
sr_rs: Kada aktivirate, plugin će dodati detalje transakcije u email potvrde.

source: Enable transaction details in the confirmation page
sr_rs: Omogućite detalje transakcije na stranici za potvrdu.

source: When enabled, plugin will add transaction details in the order confirmation page.
sr_rs: Kada aktivirate, plugin će dodati detalje transakcije na stranici za potvrdu.

source: Please enter Allsecure Exchange API Key
sr_rs: Molimo unesite API Key, koji ste dobili od AllSecure.

source: Please enter allsecureexchange API Shared Secret
sr_rs: Molimo unesite Shared Secret, koji ste dobili od Allsecure.

source: Allsecure Exchange payment request is created successfully and but payment debt status received as pending.
sr_rs: Zahtev za plaćanje je uspešno kreiran, status plaćanja je primljen na čekanju.

source: Allsecure Exchange payment request is created successfully and but payment preauthorize status received as pending.
sr_rs: Zahtev za plaćanje je uspešno kreiran, status preautorizacije plaćanja je primljen na čekanju.

source: Transaction ID
sr_rs: ID Transakcije

source: Payment is failed.
sr_rs: Plaćanje nije uspelo.

source: No order data received
sr_rs: Nisu primljeni podaci o porudžbini

source: Error from gateway.
sr_rs: Greška na mreži.

source: Your order is cancelled.
sr_rs: Vaša porudžbina je otkazana

source: Callback validation failed.
sr_rs: Validacija callback poziva nije uspela.

source: Merchant transaction id validation failed.
sr_rs: Provera ID transakcije trgovca nije uspela.

source: Allsecure Exchange payment is successfully captured.
sr_rs: Preutorizacija uspešno zaključena.

source: Allsecure Exchange payment is successfully voided.
sr_rs: Preautorizacija uspešno otkazana.

source: Unknown error
sr_rs: Nepoznata greška

source: Transaction details
bs_ba: Detalji transakcije
sr_rs: Detalji transakcije

source: Transaction Codes
bs_ba: Broj autorizacije
sr_rs: Broj autorizacije

source: Card Type
bs_ba: Tip kartice
sr_rs: Tip kartice

source: Payment Type
bs_ba: Vrsta plaćanja
sr_rs: Vrsta plaćanja

source: Currency
sr_rs: Valuta

source: Amount Paid
sr_rs: Plaćeni iznos

source: Transaction Time
bs_ba: Vrijeme transakcije
sr_rs: Vreme transakcije

source: Capture
sr_rs: Kompletiranje

source: Void
sr_rs: Otkazivanje

source: Processing...
sr_rs: Obrada

source: Are you sure you wish to process this void? This action cannot be undone
sr_rs: Da li ste sigurni da želite da izvršite otkazivanje? Ova radnja se ne može opozvati.

source: Refund amount shoule be greater than 0.
sr_rs: Iznos povraćaja treba da bude veći od 0 (nula).

source: Amount shoule be equal to order paid total.
sr_rs: Iznos treba da bude jednak ukupno uplaćenoj narudžbini.

source: Allsecure Exchange payment is successfully refunded.
sr_rs: Transakcija uspešno refundirana

source: Credit Card
sr_rs: Platna Kartica

source: <strong>Payment.js Javascript Integration</strong><br/> With the payment.js integration you can securely accept card payments and integrate card number and CVV collection directly into your shop website without the need for redirecting to a separate payment form. The payment.js library renders 2 separate iFrames for card number and CVV/CVC in your checkout page. This reduces your PCI-DSS scope to as low as it can get (PCI-DSS SAQ-A).<br/><br/> <strong>Full-Page Redirect</strong><br/> Customer are redirected to the Payment Service Provider (PSP) page. Here, the customer fills in his or her payment details, and after paying, is redirected back to your website to complete the checkout process.
sr_rs: <strong>Payment.js Javascript Integration</strong><br/> Putem payment.js integracije možete bezbedno prihvatati plaćanja platnim karticama i integrisati polja za unos broja kartice i CVV broja direktno na svojoj prodavnici bez ikakve potrebe za redirekcijom na stranicu neke treće strane. payment.js generiše 2 iFrejma za broj kartice i CVV/CVC na vašoj checkout stranici. Ovo minimizira obuhvat PCI-DSS na najniži mogući nivo (PCI-DSS SAQ-A).<br/><br/> <strong>Full-Page Redirect</strong><br/> Customer are redirected to the Payment Service Provider (PSP) page. Here, the customer fills in his or her payment details, and after paying, is redirected back to your website to complete the checkout process.

source: Accepted Cards
bs_ba: Kartice koje prihvatate
sr_rs: Kartice koje prihvatate

source: Select the cards which you would like to accept
sr_rs: Izaberite kartice koje želite da prihvatate

source: Style Details
sr_rs: Stilizacija

source: Please enter Allsecure Exchange API User
sr_rs: Molimo unesite API User, koji ste dobili od AllSecure.

source: Please enter Allsecure Exchange API Password
sr_rs: Molimo unesite API Password, koji ste dobili do AllSecure.

source: Please enter Allsecure Exchange Public Integration Key since Payment.js checkout option is enabled.
sr_rs: Molimo unesite Public Integration Key, pošto je omogućena opcija plaćanja Paiment.js.

source: Please select atleast one card type since Payment.js checkout option is enabled.
sr_rs: Izaberite najmanje jedan tip kartice pošto je omogućena opcija plaćanja Paiment.js.

source: Invalid transaction token
sr_rs: Token nije validan

source: Credit Card Information
sr_rs: Informacije o platnoj kartici

source: Card holder
bs_ba: Korisnik kartice
sr_rs: Korisnik kartice

source: This is a required field.
sr_rs: Ovo je obavezno polje.

source: Please enter a valid card holder name in this field.
sr_rs: Unesite važeće ime vlasnika kartice u ovo polje.

source: Card Number
sr_rs: Broj Kartice

source: Please enter a valid number in this field.
sr_rs: Unesite važeći broj u ovo polje.

source: This card type is not supported.
sr_rs: Ovaj tip kartice nije podržan.

source: Expiration Date
sr_rs: Datum isteka

source: Incorrect credit card expiration date.
sr_rs: Netačan datum isteka kartice.

source: CONFIG ERROR. Some fundamental error in your request
bs_ba: KONFIGURACIONA GREŠKA. Some fundamental error in your request
sr_rs: Tehnički problem prilikom slanja zahteva. Molimo pozovite trgovca.

source: CONFIG ERROR. The upstream system responded with an unknown response
bs_ba: KONFIGURACIONA GREŠKA. The upstream system responded with an unknown response
sr_rs: Tehnički problem prilikom slanja zahteva. Molimo pozovite trgovca.

source: CONFIG ERROR. Request data are malformed or missing
bs_ba: KONFIGURACIONA GREŠKA. Request data are malformed or missing
sr_rs: Tehnički problem prilikom slanja zahteva. Molimo pozovite trgovca.

source: CONFIG ERROR. Transaction could not be processed
bs_ba: KONFIGURACIONA GREŠKA. Transaction could not be processed
sr_rs: Tehnički problem prilikom slanja zahteva. Molimo pozovite trgovca.

source: CONFIG ERROR. The request signature you provided was wrong
bs_ba: KONFIGURACIONA GREŠKA. The request signature you provided was wrong
sr_rs: Tehnički problem prilikom slanja zahteva. Molimo pozovite trgovca.

source: CONFIG ERROR. The XML you provided was malformed or invalid
bs_ba: KONFIGURACIONA GREŠKA. The XML you provided was malformed or invalid
sr_rs: Tehnički problem prilikom slanja zahteva. Molimo pozovite trgovca.

source: CONFIG ERROR. Preconditions failed, e.g. capture on a failed authorize
bs_ba: KONFIGURACIONA GREŠKA. Preconditions failed, e.g. capture on a failed authorize
sr_rs: Tehnički problem prilikom slanja zahteva. Molimo pozovite trgovca.

source: CONFIG ERROR. Something is wrong your configuration, please contact your integration engineer
bs_ba: KONFIGURACIONA GREŠKA. Something is wrong your configuration, please contact your integration engineer
sr_rs: Tehnički problem prilikom slanja zahteva. Molimo pozovite trgovca.

source: CONFIG ERROR. Unexpected system error
bs_ba: KONFIGURACIONA GREŠKA. Unexpected system error
sr_rs: Tehnički problem prilikom slanja zahteva. Molimo pozovite trgovca.

source: CONFIG ERROR. We received an error which is not (yet) mapped to a better error code
bs_ba: KONFIGURACIONA GREŠKA. We received an error which is not (yet) mapped to a better error code
sr_rs: Tehnički problem prilikom slanja zahteva. Molimo pozovite trgovca.

source: Account closed. The customer cancelled permission for his payment instrument externally
bs_ba: Kartica koju ste uneli ne može biti prihvacena. Molimo pokušajte drugom karticom
sr_rs: Kartica koju ste uneli ne može biti prihvacena. Molimo pokušajte drugom karticom

source: User cancelled. Transaction was cancelled by customer
bs_ba: Transakcija je otkazana od strane kupca
sr_rs: Transakcija je otkazana od strane kupca

source: Transaction declined. Please try again later or change the card
bs_ba: Vaša transakcija nije odobrena. Pokušajte ponovo ili promjenite karticu
sr_rs: Vaša transakcija nije odobrena. Pokušajte ponovo ili promenite karticu

source: Quota regulation. Card limit reached
bs_ba: Kartica koju ste unijeli je premašila limit. Molimo izaberite drugu karticu
sr_rs: Vaša transakcija nije odobrena. Pokušajte ponovo ili promenite karticu

source: Transaction expired. Customer took to long to submit his payment info
bs_ba: Korisnik nije u predviđenom roku završio transakciju
sr_rs: Korisnik nije u predviđenom roku završio transakciju

source: Insufficient funds. Card limit reached
bs_ba: Kartica koju ste uneli je premašila limit. Molimo izaberite drugu karticu
sr_rs: Vaša transakcija nije odobrena. Pokušajte ponovo ili promenite karticu

source: Incorrect payment info. Double check and try again
bs_ba: Uneti podaci o platnoj kartici nisu tačni. Provjerite podatke i pokušajte ponovo
sr_rs: Uneti podaci o platnoj kartici nisu tacni. Proverite podatke i pokušajte ponovo

source: Invalid card. Try with some other card
bs_ba: Kartica koju ste unjeli ne može biti prihvacena. Molimo pokušajte drugom karticom
sr_rs: Kartica koju ste uneli ne može biti prihvacena. Molimo pokušajte drugom karticom

source: Expired card. Try with some other card
bs_ba: Kartica koju ste uneli je istekla. Molimo izaberite drugu karticu
sr_rs: Kartica koju ste uneli je istekla. Molimo izaberite drugu karticu

source: Invalid card. Call your bank immediately
bs_ba: Vaša transakcija nije odobrena. Molimo proverite sa bankom koja vam je izdala karticu
sr_rs: Vaša transakcija nije odobrena. Molimo proverite sa bankom koja vam je izdala karticu

source: Unsupported card. Try with some other card
bs_ba: Kartica koju ste unijeli ne može biti prihvacena. Molimo pokušajte drugom karticom
sr_rs: Kartica koju ste uneli ne može biti prihvacena. Molimo pokušajte drugom karticom

source: Transaction cancelled
bs_ba: Transakcija je otkazana
sr_rs: Transakcija je otkazana

source: Transaction declined. Please try again later or call your bank
bs_ba: Vaša transakcija nije odobrena. Molimo izaberite drugu karticu ili provjerite sa bankom koja vam je izdala karticu
sr_rs: Vaša transakcija nije odobrena. Molimo izaberite drugu karticu ili proverite sa bankom koja vam je izdala karticu

source: Invalid IBAN. Double check and try again
bs_ba: IBAN nije validan. Provjerite podatke i pokušajte ponovo
sr_rs: IBAN nije validan. Proverite podatke i pokušajte ponovo

source: Invalid BIC. Double check and try again
bs_ba: BIC nije validan. Provjerite podatke i pokušajte ponovo
sr_rs: BIC nije validan. Proverite podatke i pokušajte ponovo

source: Customer data invalid. Double check and try again
bs_ba: Podaci o korisniku nisu validni. Provjerite podatke i pokušajte ponovo
sr_rs: Podaci o korisniku nisu validni. Proverite podatke i pokušajte ponovo

source: CVV required. Double check and try again
bs_ba: CVV kod je obavezan. Provjerite podatke i pokušajte ponovo
sr_rs: CVV kod je obavezan. Proverite podatke i pokušajte ponovo

source: 3D-Secure Verification failed. Please call your bank or try with a non 3-D Secure card
bs_ba: Vaša 3D Secure autentifikacija nije uspela. Molimo pozovite banku koja vam je izdala karticu ili koristite karticu koja nije 3D-Secure
sr_rs: Vaša 3D Secure autentifikacija nije uspela. Molimo pozovite banku koja vam je izdala karticu ili koristite karticu koja nije 3D-Secure

source: COMMUNICATION PROBLEM. Timeout. Try again after a short pause
bs_ba: KOMUNIKACIJA: Transakcija je istekla. Napravite pauzu i pokušajte nešto kasnije
sr_rs: Transakcija je istekla. Napravite pauzu i pokušajte nešto kasnije

source: COMMUNICATION PROBLEM. Transaction not allowed
bs_ba: KOMUNIKACIJA: Transakcija nije dozvoljena
sr_rs: Transakcija nije dozvoljena

source: COMMUNICATION PROBLEM. System temporary unavailable. Try again after a short pause
bs_ba: KOMUNIKACIJA: Sistem privremeno nedostupan. Napravite pauzu i pokušajte nešto kasnije
sr_rs: Sistem privremeno nedostupan. Napravite pauzu i pokušajte nešto kasnije

source: Duplicate transaction ID
bs_ba: ID Transakcije već korišćen
sr_rs: ID Transakcije već korišćen

source: COMMUNICATION PROBLEM. Try again after a short pause
bs_ba: KOMUNIKACIJA: Problem u konekciji sa bankom. Napravite pauzu i pokušajte nešto kasnije
sr_rs: Problem u konekciji sa bankom. Napravite pauzu i pokušajte nešto kasnije

source: Schedule request is invalid
bs_ba: Zahtev za planiranjem transakcije nije validan
sr_rs: Zahtev za planiranjem transakcije nije validan

source: Schedule request failed
bs_ba: Zahtev za planiranjem transakcije nije prihvaćen
sr_rs: Zahtev za planiranjem transakcije nije prihvaćen

source: Schedule action is not valid
bs_ba: Planirana transakcija nije validna
sr_rs: Planirana transakcija nije validna

source: RegistrationId is required
bs_ba: RegistrationId je neophodan
sr_rs: RegistrationId je neophodan

source: RegistrationId is not valid
bs_ba: RegistrationId nije validan
sr_rs: RegistrationId nije validan

source: The registrationId must point to a "register", "debit+register" or "preauth+register"
sr_rs: Inicijalna transakcija kojom započinju planirana ponavljajuća plaćanja mora biti "register", "debit+register" ili "preuth+register"

source: The period between the initial and second transaction must be greater than 24 hours
bs_ba: Period između inicijalne i sledeće transakcije mora biti duži od 24 sata
sr_rs: Period između inicijalne i sledeće transakcije mora biti duži od 24 sata

source: The scheduleId is not valid or does not match to the connector
bs_ba: ScheduleId (id planirane transakcije) nije validan ili nije povezan na ovaj kanal plaćanja
sr_rs: ScheduleId (id planirane transakcije) nije validan ili nije povezan na ovaj kanal plaćanja

source: The startDateTime is invalid or older than 24 hours
bs_ba: Planirana početna transakcija (startDateTime) nije validnog formata ili je starija od 24h
sr_rs: Planirana početna transakcija (startDateTime) nije validnog formata ili je starija od 24h

source: The continueDateTime is invalid or older than 24 hours
bs_ba: Planirana naredna transakcija (continueDateTime ) nije validnog formata ili je starija od 24h
sr_rs: Planirana naredna transakcija (continueDateTime ) nije validnog formata ili je starija od 24h

source: The status of the schedule is not valid for the requested operation
bs_ba: Status planirane transakcije nije validnog formata za zahtjevanu operaciju
sr_rs: Status planirane transakcije nije validnog formata za zahtevanu operaciju

source: Cards
bs_ba: Platne Kartice

source: AllSecure Capture Request Failed. %s
bs_ba: Capture nije uspeo. %s

source: AllSecure Reversal Request Failed. %s
bs_ba: Reversal nije uspeo. %s

source: This controls the description which the user sees during checkout
bs_ba: Opis metoda plaćanja

source: You can switch between different environments, by selecting the corresponding operation mode
bs_ba: Izaberite okruženje zavisno od toga da li testirate ili ste prešli u produkciju

source: Please enter your Exchange API User. This is needed in order to take the payment
bs_ba: Molimo pažljivo unesite Exchange API User koji ste dobili od AllSecure. Ovaj podatak je neophodan kako bi procesirali plaćanja

source: Please enter your Exchange API Password. This is needed in order to take the payment
bs_ba: Molimo pažljivo unesite Exchange API Lozinku koju ste dobili od AllSecure. Ovaj podatak je neophodan kako bi procesirali plaćanja

source: Please enter your Exchange API Key. This is needed in order to take the payment
bs_ba: Molimo pažljivo unesite Exchange API Ključ koji ste dobili od AllSecure. Ovaj podatak je neophodan kako bi procesirali plaćanja

source: Please enter your Exchange Shared Secret. This is needed in order to take the payment
bs_ba: Molimo pažljivo unesite Exchange API Secret koji ste dobili od AllSecure. Ovaj podatak je neophodan kako bi procesirali plaćanja

source: Public Integration Key required only if seamless integration required
bs_ba: Public Integration Key koji ste dobili od AllSecure je neophodan samo ukoliko želite integraciju bez redirekcije

source: Choose type of Payment you wish to use
bs_ba: Izaberite tip naplate koji želite da koristite

source: Acquiring Partner
bs_ba: Banka partner

source: Acquirer where holding Merchant Account
bs_ba: Prihvatilac gde je otvoren namenski račun

source: Select
bs_ba: Izaberite

source: Choose type of banner you wish to use
bs_ba: Izaberite tip banera koji ćete prikazati u podnožju sajta

source: No Banner
bs_ba: Bez banera

source: Light Background
bs_ba: Svijetla pozadina

source: Dark Background
bs_ba: Tamna pozadina

source: Merchant Details
bs_ba: Detalji o prodavcu

source: Merchant Info
bs_ba: Naziv i lokacija

source: Please enter your Merchant Info to be displayed near the payment form
bs_ba: Molimo unesite naziv i adresu pravnog lica koje vrši naplatu

source: Merchant Email
bs_ba: Email adresa

source: Please enter your Merchant Email
bs_ba: Molimo unesite email adresu prodavca

source: Shop URL
bs_ba: URL prodavnice

source: Please enter your Shop URL
bs_ba: Molimo unesite Url adresu prodavnice

source: Other Details
bs_ba: Ostali detalji

source: Please enter your ID as displayed on your invoice from AllSecure
bs_ba: Prva tri broja iz broja fakture koju redovno primate od AllSecure (samo za produkciju)

source: Enable Version Tracker
bs_ba: Omogućite proveru verzije

source: When enabled, you accept to share your IP, email address, etc with us
bs_ba: Kada je omogućeno, razmenjivaćete podatke sa nama u cilju ažuriranja verzija modula

source: THIS IS THE TEST MODE
bs_ba: OVO JE TEST. NOVAC NEĆE BITI NAPLAĆEN

source: Cardholder not valid
bs_ba: Korisnik kartice nije validan

source: Card number not valid
bs_ba: Broj kartice nije validan

source: CVV not valid
bs_ba: CVV nije validan

source: Expiry date not valid
bs_ba: Datum važenja kartice nije validan

source: Payee
bs_ba: Naplaćuje

source: Card number
bs_ba: Broj kartice

source: Transaction Unsuccessful. The status message <b>%s</b>
bs_ba: Transakcija neuspješna. Odgovor <b>%s</b>

source: The registrationId must point to a "register", "debit+register" or "preuth+register"
bs_ba: RegistrationId nema odgovarajuću referencu

source: Initial transaction is not a "register", "debit+register" or "preuth+register"
bs_ba: Inicijalna transakcija kojom započinju planirana ponavljajuća plaćanja mora biti "register", "debit+register" ili "preuth+register"
